quantummongolia/industrial-iot/esp32_firmware/teerem/src/main.cpp
  WiFi.onEvent(onWifiEvent);
  wifiConnect();
  firebaseInit();

  esp_task_wdt_config_t wdtConfig = {.timeout_ms = cfg::WDT_TIMEOUT_S * 1000,
                                     .idle_core_mask = 0,
                                     .trigger_panic = true};
  esp_task_wdt_reconfigure(&wdtConfig);
  esp_task_wdt_add(NULL);

  // Supervisor watchdog task — setup дууссаны дараа эхлүүлнэ (setup-ийн блоклох
  // wifiConnect зэргийг false-restart болгохгүйн тулд). Core 0.
  xTaskCreatePinnedToCore(watchdogTask, "wdog", 2048, nullptr, 1, nullptr, 0);
  Serial.printf("[WDT] Watchdog started — %lu second timeout\n",
                (unsigned long)cfg::WDT_TIMEOUT_S);
}

void loop() {
  g_loopBeat++;           // supervisor task-д "loop ахиж байна" дохио
  esp_task_wdt_reset();
  unsigned long now = millis();

  // ── Long-running stability watchdog ────────────────────────────────
  // Heap fragmentation (Firebase TLS буфер г.м.) удаан ажиллах тусам
  // хуримтлагдаж тогтворгүй болгож болзошгүй. 5 минут тутамд heap-г log
  // хийнэ. Free heap босгоос (20KB) доош унавал эсвэл uptime 24 цаг хэтэрвэл
  // cleaн restart хийнэ.
  if (now - lastHeapLogTime >= cfg::HEAP_LOG_INTERVAL_MS) {
    lastHeapLogTime = now;
    Serial.printf("[Heap] Free: %u | Min ever: %u | Uptime: %lus\n",
                  ESP.getFreeHeap(), ESP.getMinFreeHeap(), now / 1000);
  }
  if (ESP.getFreeHeap() < cfg::MIN_FREE_HEAP_BYTES) {
    Serial.printf("[Stability] Free heap %u < %u — restarting\n",
                  ESP.getFreeHeap(), cfg::MIN_FREE_HEAP_BYTES);
    delay(200);
    ESP.restart();
  }
  if (now >= cfg::MAX_UPTIME_MS) {
    Serial.println("[Stability] Reached 24h uptime — scheduled restart");
    delay(200);
    ESP.restart();
  }

  // ---- Connectivity watchdog ----
  // WiFi эсвэл Firebase нь cfg::MAX_OFFLINE_MS-ээс удаан салгагдвал цэвэр reboot.
  // WiFi буцаж ирэхэд / сенсор сэргэхэд төхөөрөмж 'бүр мөсөн алга' болохгүй,
  // заавал өөрөө сэргэх баталгаа. Firebase.ready()-г цикл бүрт дуудах нь
  // token-refresh-ийг тасралтгүй ажиллуулж бас тустай.
  if (WiFi.status() == WL_CONNECTED) {
    wifiDownSince = 0;
  } else if (wifiDownSince == 0) {
    wifiDownSince = now;
  } else if (now - wifiDownSince >= cfg::MAX_OFFLINE_MS) {
    Serial.println("[Watchdog] WiFi offline too long — clean restart");
    Serial.flush();
    delay(200);
    ESP.restart();
  }

  if (WiFi.status() == WL_CONNECTED && !Firebase.ready()) {
    if (fbNotReadySince == 0) {
      fbNotReadySince = now;
    } else if (now - fbNotReadySince >= cfg::MAX_OFFLINE_MS) {
      Serial.println("[Watchdog] Firebase not ready too long — clean restart");
      Serial.flush();
      delay(200);
      ESP.restart();
    }
  } else {
    fbNotReadySince = 0;
  }

  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    Serial.println("[WiFi] retry — async reconnect");
    WiFi.reconnect();
  }

  static unsigned long lastPoll = 0;
  if (now - lastPoll < cfg::POLL_MS)
    return;
  lastPoll = now;

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[WiFi] not connected");
    led::setMode(led::SLOW_RED);
    return;
  }

  // Boot үед уншиж чадаагүй CT primary-уудыг дахин оролдох — нэг slave/cycle
  // (RS485 bus-ыг сенсорын уншилттай зэрэгцэхгүй).
  {
    static const uint8_t spmSlaves[4] = {cfg::EM01_SLAVE, cfg::EM02_SLAVE,
                                         cfg::EM04_SLAVE, cfg::EM05_SLAVE};
    for (uint8_t s : spmSlaves) {
      if (!ctPrimaryKnown[s]) {
        Spm33_readCtPrimary(modbus, s);
        delay(cfg::FRAME_GAP_MS);
        break; // зөвхөн нэгийг л оролдоно, цаг хэмнэхийн тулд
      }
    }
  }

  // Цикл бүрд flow-cycle эсвэл totalizer-cycle гэсэн 2 төрлийн нэг нь явна.
  // RS485 bus-н ачааллыг бууруулж, "хоёуланг нь зэрэг уншихгүй" гэсэн
  // шаардлагыг хангахын тулд totalizer-ийг тусад нь 1 минутын циклд уншина.
  // Boot-ийн дараа нэг удаа totalizer-ийг шууд уншиж cache-г бөглөнө.
  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  // Энэ цикл-д Firebase upload руу очих утгууд (flow cycle-ийнх)
  float flow = 0;
  bool flowOk = false;
  Spm33Reading em01, em02, em04, em05;
  float feedFlow = 0;
  bool feedFlowOk = false;
  uint16_t ulsRaw = 0;
  bool ulsLevelOk = false;
  float ulsLevel = 0.0f;

  // Totalizer cycle-ийн төлөв (uploaded утгууд cache-ээс)
  double weightT = 0;
  bool weightOk = false;
  float feedTotal = 0;
  bool feedTotalOk = false;

  if (totalizerCycle) {
    // ── Totalizer cycle: жингийн нийт жин + EM01-05 энерги + feed water totalizer
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

    weightOk = withRetry(
        [&] { return modbus.readDouble(cfg::SCALE_SLAVE, cfg::REG_WEIGHT_T, weightT); });
    if (weightOk) { cachedWeightT = weightT; cachedWeightTValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em01 = Spm33_readEnergy(modbus, cfg::EM01_SLAVE);
    if (em01.energyOk) { cachedEm01EnergyKWh = em01.energyKWh; cachedEm01EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em02 = Spm33_readEnergy(modbus, cfg::EM02_SLAVE);
    if (em02.energyOk) { cachedEm02EnergyKWh = em02.energyKWh; cachedEm02EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em04 = Spm33_readEnergy(modbus, cfg::EM04_SLAVE);
    if (em04.energyOk) { cachedEm04EnergyKWh = em04.energyKWh; cachedEm04EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em05 = Spm33_readEnergy(modbus, cfg::EM05_SLAVE);
    if (em05.energyOk) { cachedEm05EnergyKWh = em05.energyKWh; cachedEm05EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    feedTotalOk = withRetry(
        [&] { return modbus.readTotalizer(cfg::FLOW_SLAVE, cfg::FLOW_REG_TOTAL, feedTotal); });
    if (feedTotalOk) { cachedFeedTotal = feedTotal; cachedFeedTotalValid = true; }
    delay(cfg::FRAME_GAP_MS);

    Serial.printf("[Totalizer] Weight:%s EM01:%s EM02:%s EM04:%s EM05:%s Feed:%s\n",
                  weightOk ? String(weightT, 3).c_str() : "#",
                  em01.energyOk ? String(em01.energyKWh, 1).c_str() : "#",
                  em02.energyOk ? String(em02.energyKWh, 1).c_str() : "#",
                  em04.energyOk ? String(em04.energyKWh, 1).c_str() : "#",
                  em05.energyOk ? String(em05.energyKWh, 1).c_str() : "#",
                  feedTotalOk ? String(feedTotal, 2).c_str() : "#");
  } else {
    // ── Flow cycle: жингийн урсгал + EM01-05 power + currents + feed water flow + level
    flowOk = withRetry(
        [&] { return modbus.readFloat(cfg::SCALE_SLAVE, cfg::REG_FLOW, flow); });
    delay(cfg::FRAME_GAP_MS);

    em01 = Spm33_readPower(modbus, cfg::EM01_SLAVE, false);
    delay(cfg::FRAME_GAP_MS);
    em02 = Spm33_readPower(modbus, cfg::EM02_SLAVE, false);
    delay(cfg::FRAME_GAP_MS);
    em04 = Spm33_readPower(modbus, cfg::EM04_SLAVE, true);
    delay(cfg::FRAME_GAP_MS);
    em05 = Spm33_readPower(modbus, cfg::EM05_SLAVE, true);
    delay(cfg::FRAME_GAP_MS);

    feedFlowOk = withRetry(
        [&] { return modbus.readFloat(cfg::FLOW_SLAVE, cfg::FLOW_REG_RATE, feedFlow); });
    delay(cfg::FRAME_GAP_MS);

    ulsLevelOk = withRetry(
        [&] { return modbus.readU16(cfg::ULS_SLAVE, cfg::REG_ULS_LEVEL, ulsRaw); });
    ulsLevel = ulsLevelOk ? (ulsRaw / 1000.0f) : 0.0f;

    // Mount height — савны нийт өндөр, нэг л удаа (амжилттай болтол оролдоно).
    if (!ulsMountKnown) {
      uint16_t mountRaw = 0;
      if (withRetry([&] { return modbus.readU16(cfg::ULS_SLAVE, cfg::REG_ULS_MOUNT, mountRaw); }) && mountRaw > 0) {
        ulsMountM = mountRaw / 1000.0f; ulsMountKnown = true;
        Serial.printf("[ULS] Mount height: %.3f m\n", ulsMountM);
      }
    }

    Serial.printf("[Flow] Scale:%s EM01:%s EM02:%s EM04:%s EM05:%s Feed:%s Tank:%s\n",
                  flowOk ? String(flow, 2).c_str() : "#",
                  em01.powerOk ? String(em01.powerKW, 2).c_str() : "#",
                  em02.powerOk ? String(em02.powerKW, 2).c_str() : "#",
                  em04.powerOk ? String(em04.powerKW, 2).c_str() : "#",
                  em05.powerOk ? String(em05.powerKW, 2).c_str() : "#",
                  feedFlowOk ? String(feedFlow, 2).c_str() : "#",
                  ulsLevelOk ? String(ulsLevel, 3).c_str() : "#");
  }

  // ── Алдаа escalate ──────────────────────────────────────────────
  bool anyOk = flowOk || weightOk || em01.powerOk || em01.energyOk ||
               em02.powerOk || em02.energyOk || em04.powerOk || em04.energyOk ||
               em04.currentsOk || em05.powerOk || em05.energyOk ||
               em05.currentsOk || feedFlowOk || feedTotalOk || ulsLevelOk;
  if (anyOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_FAILS)
      recoverModbusBus();
  }

  // ── 5) Firebase upload — root("/") нэг update нь rules engine-д бүх 13+
  // замыг шалгуулж response timeout үүсгэдэг. Тиймээс /teerem ба
  // /energy_meters subtree-үүдийг тус тусад нь жижиг updateNode-оор бичнэ.
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] ready");
    ota::begin(&fbData);  // DEVICE_ID register + командын stream нээх
  }

  // ─ Subtree 1: /teerem ──────────────────────────────────────────────
  bool teeremOk = true;
  bool teeremAny = false;
  {
    FirebaseJson j;
    if (totalizerCycle) {
      // Totalizer cycle: жингийн нийт жин + feed water totalizer
      if (weightOk) {
        j.set("cumulative_kg", (int)(cachedWeightT * 1000.0));
        teeremAny = true;
      }
      if (feedTotalOk) {
        j.set("feed_water/totalizer", cachedFeedTotal);
        teeremAny = true;
      }
    } else {
      // Flow cycle: жингийн урсгал + feed water flow + water tank level
      if (flowOk) { j.set("weight_rate", liveValue(flow, lvWeight)); teeremAny = true; }
      if (feedFlowOk) {
        j.set("feed_water/flow_rate", liveValue(feedFlow, lvFeed));
        teeremAny = true;
      }
      if (ulsLevelOk) {
        j.set("water_tank/level", liveValue(ulsLevel, lvWaterTank));
        teeremAny = true;
      }
      // Mount height-г нэг удаа нийтэлнэ (амжилттай upload болтол оролдоно).
      if (ulsMountKnown && !ulsMountSent) {
        j.set("water_tank/mount_height", ulsMountM);
        teeremAny = true;
      }
    }
    if (teeremAny) {
      j.set("last_updated", (int)(millis() / 1000));
      teeremOk = Firebase.RTDB.updateNodeSilent(&fbData, "/teerem", &j);
      if (!teeremOk)
        Serial.printf("[Firebase] /teerem ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  // ─ Subtree 2: /energy_meters ───────────────────────────────────────
  // Flow cycle: power + currents (instantaneous утгууд)
  // Totalizer cycle: total_energy_kwh (cumulative утгууд)
  bool emOk = true;
  bool emAny = false;
  {
    FirebaseJson j;
    auto addEm = [&](const char *id, const Spm33Reading &r, bool withI, LiveState &lv) {
      String base = String(id) + "/";
      if (totalizerCycle) {
        if (r.energyOk) {
          j.set((base + "total_energy_kwh").c_str(), r.energyKWh);
          emAny = true;
        }
      } else {
        if (r.powerOk) {
          j.set((base + "power_kw").c_str(), liveValue(r.powerKW, lv));
          emAny = true;
        }
        if (withI && r.currentsOk) {
          j.set((base + "current_a").c_str(), r.currentA);
          j.set((base + "current_b").c_str(), r.currentB);
          j.set((base + "current_c").c_str(), r.currentC);
          emAny = true;
        }
      }
    };
    addEm("em01", em01, false, lvEm01);
    addEm("em02", em02, false, lvEm02);
    addEm("em04", em04, true, lvEm04);
    addEm("em05", em05, true, lvEm05);
    if (emAny) {
      emOk = Firebase.RTDB.updateNodeSilent(&fbData, "/energy_meters", &j);
      if (!emOk)
        Serial.printf("[Firebase] /energy_meters ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  if (!teeremAny && !emAny) {
    led::setMode(led::SLOW_RED);
    return;
  }

  if (teeremOk && emOk) {
    Serial.println("[Firebase] Updated");
    fbOnSuccess();
    if (ulsMountKnown) ulsMountSent = true; // mount height нийтлэгдсэн
    led::setMode(led::OFF);
    led::pulse();
  } else {
    fbOnFailure();
    led::setMode(led::SLOW_RED);
  }

  // OTA heartbeat + self-test gate (амжилттай upload бүрд +1)
  ota::loop(&fbData, teeremOk && emOk);
}
